<a href="https://colab.research.google.com/github/PaletteofDesign/recreate-interest-vs-principal-graph/blob/main/recreate_interest_vs_principal_graph.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
from google.colab import drive
drive.mount('/content/drive')

Mounted at /content/drive

In [2]:
import pandas as pd
import matplotlib.pyplot as plt

In [4]:
f_name = '/content/mortgages.csv'
df = pd.read_csv(f_name)
df.head()

   Month  Starting Balance  Repayment  ...  New Balance  Mortgage Name  Interest Rate
0      1         400000.00    1686.42  ...    399313.58        30 Year           0.03
1      2         399313.58    1686.42  ...    398625.44        30 Year           0.03
2      3         398625.44    1686.42  ...    397935.58        30 Year           0.03
3      4         397935.58    1686.42  ...    397243.99        30 Year           0.03
4      5         397243.99    1686.42  ...    396550.67        30 Year           0.03

[5 rows x 8 columns]

In [23]:
years_30 = df['Mortgage Name']=='30 Year'
len(years_30)

1080

In [25]:
rate_3_percent = df['Interest Rate']==0.03

In [32]:
n_df = df.loc[years_30 & rate_3_percent,:]
n_df.head()

   Month  Starting Balance  Repayment  ...  New Balance  Mortgage Name  Interest Rate
0      1         400000.00    1686.42  ...    399313.58        30 Year           0.03
1      2         399313.58    1686.42  ...    398625.44        30 Year           0.03
2      3         398625.44    1686.42  ...    397935.58        30 Year           0.03
3      4         397935.58    1686.42  ...    397243.99        30 Year           0.03
4      5         397243.99    1686.42  ...    396550.67        30 Year           0.03

[5 rows x 8 columns]

In [34]:
n_df['Mortgage Name'].cumsum()

0                                                30 Year
1                                         30 Year30 Year
2                                  30 Year30 Year30 Year
3                           30 Year30 Year30 Year30 Year
4                    30 Year30 Year30 Year30 Year30 Year
                             ...
355    30 Year30 Year30 Year30 Year30 Year30 Year30 Y...
356    30 Year30 Year30 Year30 Year30 Year30 Year30 Y...
357    30 Year30 Year30 Year30 Year30 Year30 Year30 Y...
358    30 Year30 Year30 Year30 Year30 Year30 Year30 Y...
359    30 Year30 Year30 Year30 Year30 Year30 Year30 Y...
Name: Mortgage Name, Length: 360, dtype: object